public class Main {
    /*
    Иванов Игорь Игоревич:
 1. ДЗ3 - хотелось бы увидеть методы и переменные. у большинство классов их нет.

 2. ДЗ4 - очень круто что переиспользуется метод delete.
   Если ты переопределил equals, нужно ли было переопределять hashCode? - переопределил!!!

 3. ДЗ5 - Плохо использовать sout. Если уж написал два варианта,
   напиши какая разница по скорости. Два варианта дают одинаковый резаультат?

   3.1.Sout использован намерянно, для наглядного вывода и уменьшения кол-ва строк кода;
   3.2 Вывел результат быстродействия разных вариантов (IndexOf и Map);



   1. Когда необходимо использовать flush();
   2. В чем разница между разными OutputStream, если результат одинаковый;

     */
}
