public class Main {
    /*
    Иванов Игорь Игоревич:
 1. ДЗ3 - хотелось бы увидеть методы и переменные. у большинство классов их нет.

 2. ДЗ4 - очень круто что переиспользуется метод delete.
   Если ты переопределил equals, нужно ли было переопределять hashCode? - переопределил!!!

 3. ДЗ5 - Плохо использовать sout. Если уж написал два варианта,
   напиши какая разница по скорости. Два варианта дают одинаковый резаультат? - сделано!!!

   3.1.Sout использован намерянно, для наглядного вывода и уменьшения кол-ва строк кода;
   3.2 Вывел результат быстродействия разных вариантов (IndexOf и Map);



   1. Посмотрим ДЗ7
   2. В чем разница между разными OutputStream, если результат одинаковый;
   3. Советы по использованию интерфейсов;
   3.1 Интерфейс это набор методов для различных классов? Определение функционала для классов?
   3.2 В интерфейс помещать только универсальные методы?
   3.3 Как правильно выбирать критерии отбора методов для интерфейса?


     */
}
